
export const color = {
    main: "#9898ff",
    button1: "#7a7aff",
    button1Text: "#fff",
    button2: "#ffc107",
    button2Text: "#000",
    modalBackground: "#9898ff50",
    modal: "#fff",
    optionSelectbox: "#c7b2ff"
}

// #9898ff (기본 색상)
// #c7b2ff (변형된 보색)
// #7a7aff (더 어두운 변형)
// #ffc9ff (보색)
// #ffa7a7 (다른 톤의 보색)

// #ffb74d (주황색 계열):보색으로 주황색을 사용하면 선명한 대비를 얻을 수 있습니다.
// #66bb6a (녹색 계열): 쿨톤의 파란색과 어울리는 녹색은 상쾌하고 조화로운 느낌을 줄 수 있습니다.
// #ff6f61 (레드 계열): 따뜻한 레드는 파란색과 대비가 강하여 활기를 더해줄 수 있습니다.
// #ffc107 (노란색 계열): 밝은 노란색은 상큼하고 활기찬 느낌을 주며, 파란색과 잘 어울립니다.
// #9c27b0 (보라색 계열): 진한 보라색은 쿨톤의 파란색과 잘 어울리며, 고급스러움을 더해줄 수 있